test/update.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:q0="http://springbootwebservice.com" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <q0:update>
      <q0:symbol>FB</q0:symbol>
      <q0:price>382.56</q0:price>
    </q0:update>
  </soapenv:Body>
</soapenv:Envelope>